#pragma once
//-----------------------------------------------------------------------------
#include <vector>
#include <string>
//-----------------------------------------------------------------------------
namespace utils
{
    //! Получить список путей к файлам в директории
    //! \param dir_path путь к директории
    //! \return возвращает список путей к файлам
    std::vector<std::string> DirFiles(const std::string& dir_path);

    //! Вычислить хэш строки
    //! \param s строка
    //! \return возвращает хэш строки
    std::string MD5(const std::string& s);
}
//-----------------------------------------------------------------------------
